betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_tim.c
/********************************** (C) COPYRIGHT
 * ******************************* File Name          : ch32h417_tim.c Author
 *          : WCH Version            : V1.0.0 Date               : 2025/03/01
 * Description        : This file provides all the TIM firmware functions.
 *********************************************************************************
 * Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
 * Attention: This software (modified or not) and binary are used for
 * microcontroller manufactured by Nanjing Qinheng Microelectronics.
 *******************************************************************************/
#include "ch32h417_tim.h"
#include "ch32h417_rcc.h"

/* TIM registers bit mask */
#define SMCFGR_ETR_Mask ((uint16_t)0x00FF)
#define CHCTLR_Offset ((uint16_t)0x0018)
#define CCER_CCE_Set ((uint16_t)0x0001)
#define CCER_CCNE_Set ((uint16_t)0x0004)

static void TI1_Config(TIM_TypeDef *TIMx, uint16_t TIM_ICPolarity,
                       uint16_t TIM_ICSelection, uint16_t TIM_ICFilter);
static void TI2_Config(TIM_TypeDef *TIMx, uint16_t TIM_ICPolarity,
                       uint16_t TIM_ICSelection, uint16_t TIM_ICFilter);
static void TI3_Config(TIM_TypeDef *TIMx, uint16_t TIM_ICPolarity,
                       uint16_t TIM_ICSelection, uint16_t TIM_ICFilter);
static void TI4_Config(TIM_TypeDef *TIMx, uint16_t TIM_ICPolarity,
                       uint16_t TIM_ICSelection, uint16_t TIM_ICFilter);

/*********************************************************************
 * @fn      TIM_DeInit
 *
 * @brief   Deinitializes the TIMx peripheral registers to their default
 *        reset values.
 *
 * @param   TIMx - where x can be 1 to 12 to select the TIM peripheral.
 *
 * @return  none
 */
void TIM_DeInit(TIM_TypeDef *TIMx) {
  if (TIMx == TIM1) {
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_TIM1, ENABLE);
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_TIM1, DISABLE);
  } else if (TIMx == TIM8) {
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_TIM8, ENABLE);
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_TIM8, DISABLE);
  } else if (TIMx == TIM9) {
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_TIM9, ENABLE);
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_TIM9, DISABLE);
  } else if (TIMx == TIM10) {
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_TIM10, ENABLE);
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_TIM10, DISABLE);
  } else if (TIMx == TIM11) {
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_TIM11, ENABLE);
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_TIM11, DISABLE);
  } else if (TIMx == TIM12) {
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_TIM12, ENABLE);
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_TIM12, DISABLE);
  } else if (TIMx == TIM2) {
    RCC_HB1PeriphResetCmd(RCC_HB1Periph_TIM2, ENABLE);
    RCC_HB1PeriphResetCmd(RCC_HB1Periph_TIM2, DISABLE);
  } else if (TIMx == TIM3) {
    RCC_HB1PeriphResetCmd(RCC_HB1Periph_TIM3, ENABLE);
    RCC_HB1PeriphResetCmd(RCC_HB1Periph_TIM3, DISABLE);
  } else if (TIMx == TIM4) {
    RCC_HB1PeriphResetCmd(RCC_HB1Periph_TIM4, ENABLE);
    RCC_HB1PeriphResetCmd(RCC_HB1Periph_TIM4, DISABLE);
  } else if (TIMx == TIM5) {
    RCC_HB1PeriphResetCmd(RCC_HB1Periph_TIM5, ENABLE);
    RCC_HB1PeriphResetCmd(RCC_HB1Periph_TIM5, DISABLE);
  } else if (TIMx == TIM6) {
    RCC_HB1PeriphResetCmd(RCC_HB1Periph_TIM6, ENABLE);
    RCC_HB1PeriphResetCmd(RCC_HB1Periph_TIM6, DISABLE);
  } else if (TIMx == TIM7) {
    RCC_HB1PeriphResetCmd(RCC_HB1Periph_TIM7, ENABLE);
    RCC_HB1PeriphResetCmd(RCC_HB1Periph_TIM7, DISABLE);
  }
}

/*********************************************************************
 * @fn      TIM_TimeBaseInit
 *
 * @brief   Initializes the TIMx Time Base Unit peripheral according to
 *        the specified parameters in the TIM_TimeBaseInitStruct.
 *
 * @param   TIMx - where x can be (1,2,3,4,5,8)  to select the TIM peripheral.
 *          TIM_TimeBaseInitStruct - pointer to a TIM_TimeBaseInitTypeDef
 *        structure.
 *
 * @return  none
 */
void TIM_TimeBaseInit(TIM_TypeDef *TIMx,
                      TIM_TimeBaseInitTypeDef *TIM_TimeBaseInitStruct) {
  uint16_t tmpcr1 = 0;

  /* if((TIMx == TIM1) || (TIMx == TIM8)|| (TIMx == TIM2)|| (TIMx == TIM3)\
  //    || (TIMx == TIM4)|| (TIMx == TIM5)) */
  {
    tmpcr1 = TIMx->CTLR1;
    tmpcr1 &= (uint16_t)(~((uint16_t)(TIM_DIR | TIM_CMS)));
    tmpcr1 |= (uint32_t)TIM_TimeBaseInitStruct->TIM_CounterMode;
    tmpcr1 &= (uint16_t)(~((uint16_t)TIM_CTLR1_CKD));
    tmpcr1 |= (uint32_t)TIM_TimeBaseInitStruct->TIM_ClockDivision;
    TIMx->CTLR1 = tmpcr1;
  }

  if (TIMx == TIM9 || TIMx == TIM10 || TIMx == TIM11 || TIMx == TIM12) {
    TIMx->ATRLR_32 = TIM_TimeBaseInitStruct->TIM_Period;
  } else {
    TIMx->ATRLR = TIM_TimeBaseInitStruct->TIM_Period;
  }

  TIMx->PSC = TIM_TimeBaseInitStruct->TIM_Prescaler;

  if ((TIMx == TIM1) || (TIMx == TIM8)) {
    TIMx->RPTCR = TIM_TimeBaseInitStruct->TIM_RepetitionCounter;
  }

  TIMx->SWEVGR = TIM_PSCReloadMode_Immediate;
}

/*********************************************************************
 * @fn      TIM_OC1Init
 *
 * @brief   Initializes the TIMx Channel1 according to the specified
 *        parameters in the TIM_OCInitStruct.
 *
 * @param   TIMx - where x (1,2,3,4,5,8) to select the TIM peripheral.
 *          TIM_OCInitStruct - pointer to a TIM_OCInitTypeDef structure.
 *
 * @return  none
 */
void TIM_OC1Init(TIM_TypeDef *TIMx, TIM_OCInitTypeDef *TIM_OCInitStruct) {
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

  TIMx->CCER &= (uint16_t)(~(uint16_t)TIM_CC1E);
  tmpccer = TIMx->CCER;
  tmpcr2 = TIMx->CTLR2;
  tmpccmrx = TIMx->CHCTLR1;
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_OC1M));
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CC1S));
  tmpccmrx |= TIM_OCInitStruct->TIM_OCMode;
  tmpccer &= (uint16_t)(~((uint16_t)TIM_CC1P));
  tmpccer |= TIM_OCInitStruct->TIM_OCPolarity;
  tmpccer |= TIM_OCInitStruct->TIM_OutputState;

  if ((TIMx == TIM1) || (TIMx == TIM8)) {
    tmpccer &= (uint16_t)(~((uint16_t)TIM_CC1NP));
    tmpccer |= TIM_OCInitStruct->TIM_OCNPolarity;

    tmpccer &= (uint16_t)(~((uint16_t)TIM_CC1NE));
    tmpccer |= TIM_OCInitStruct->TIM_OutputNState;

