betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_tim.c
    tmpcr2 &= (uint16_t)(~((uint16_t)TIM_OIS1));
    tmpcr2 &= (uint16_t)(~((uint16_t)TIM_OIS1N));

    tmpcr2 |= TIM_OCInitStruct->TIM_OCIdleState;
    tmpcr2 |= TIM_OCInitStruct->TIM_OCNIdleState;
  }

  TIMx->CTLR2 = tmpcr2;
  TIMx->CHCTLR1 = tmpccmrx;
  if (TIMx == TIM9 || TIMx == TIM10 || TIMx == TIM11 || TIMx == TIM12) {
    TIMx->CH1CVR_32 = TIM_OCInitStruct->TIM_Pulse;
  } else {
    TIMx->CH1CVR = TIM_OCInitStruct->TIM_Pulse;
  }
  TIMx->CCER = tmpccer;
}

/*********************************************************************
 * @fn      TIM_OC2Init
 *
 * @brief   Initializes the TIMx Channel2 according to the specified
 *        parameters in the TIM_OCInitStruct.
 *
 * @param   TIMx - where x (1,2,3,4,5,8) to select the TIM peripheral.
 *          TIM_OCInitStruct - pointer to a TIM_OCInitTypeDef structure.
 *
 * @return  none
 */
void TIM_OC2Init(TIM_TypeDef *TIMx, TIM_OCInitTypeDef *TIM_OCInitStruct) {
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

  TIMx->CCER &= (uint16_t)(~((uint16_t)TIM_CC2E));
  tmpccer = TIMx->CCER;
  tmpcr2 = TIMx->CTLR2;
  tmpccmrx = TIMx->CHCTLR1;
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_OC2M));
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CC2S));
  tmpccmrx |= (uint16_t)(TIM_OCInitStruct->TIM_OCMode << 8);
  tmpccer &= (uint16_t)(~((uint16_t)TIM_CC2P));
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCPolarity << 4);
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputState << 4);

  if ((TIMx == TIM1) || (TIMx == TIM8)) {
    tmpccer &= (uint16_t)(~((uint16_t)TIM_CC2NP));
    tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCNPolarity << 4);
    tmpccer &= (uint16_t)(~((uint16_t)TIM_CC2NE));
    tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputNState << 4);

    tmpcr2 &= (uint16_t)(~((uint16_t)TIM_OIS2));
    tmpcr2 &= (uint16_t)(~((uint16_t)TIM_OIS2N));
    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCIdleState << 2);
    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCNIdleState << 2);
  }

  TIMx->CTLR2 = tmpcr2;
  TIMx->CHCTLR1 = tmpccmrx;
  if (TIMx == TIM9 || TIMx == TIM10 || TIMx == TIM11 || TIMx == TIM12) {
    TIMx->CH2CVR_32 = TIM_OCInitStruct->TIM_Pulse;
  } else {
    TIMx->CH2CVR = TIM_OCInitStruct->TIM_Pulse;
  }
  TIMx->CCER = tmpccer;
}

/*********************************************************************
 * @fn      TIM_OC3Init
 *
 * @brief   Initializes the TIMx Channel3 according to the specified
 *        parameters in the TIM_OCInitStruct.
 *
 * @param   TIMx - where x (1,2,3,4,5,8) to select the TIM peripheral.
 *          TIM_OCInitStruct - pointer to a TIM_OCInitTypeDef structure.
 *
 * @return  none
 */
void TIM_OC3Init(TIM_TypeDef *TIMx, TIM_OCInitTypeDef *TIM_OCInitStruct) {
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

  TIMx->CCER &= (uint16_t)(~((uint16_t)TIM_CC3E));
  tmpccer = TIMx->CCER;
  tmpcr2 = TIMx->CTLR2;
  tmpccmrx = TIMx->CHCTLR2;
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_OC3M));
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CC3S));
  tmpccmrx |= TIM_OCInitStruct->TIM_OCMode;
  tmpccer &= (uint16_t)(~((uint16_t)TIM_CC3P));
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCPolarity << 8);
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputState << 8);

  if ((TIMx == TIM1) || (TIMx == TIM8)) {
    tmpccer &= (uint16_t)(~((uint16_t)TIM_CC3NP));
    tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCNPolarity << 8);
    tmpccer &= (uint16_t)(~((uint16_t)TIM_CC3NE));
    tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputNState << 8);
    tmpcr2 &= (uint16_t)(~((uint16_t)TIM_OIS3));
    tmpcr2 &= (uint16_t)(~((uint16_t)TIM_OIS3N));
    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCIdleState << 4);
    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCNIdleState << 4);
  }

  TIMx->CTLR2 = tmpcr2;
  TIMx->CHCTLR2 = tmpccmrx;
  if (TIMx == TIM9 || TIMx == TIM10 || TIMx == TIM11 || TIMx == TIM12) {
    TIMx->CH3CVR_32 = TIM_OCInitStruct->TIM_Pulse;
  } else {
    TIMx->CH3CVR = TIM_OCInitStruct->TIM_Pulse;
  }
  TIMx->CCER = tmpccer;
}

/*********************************************************************
 * @fn      TIM_OC4Init
 *
 * @brief   Initializes the TIMx Channel4 according to the specified
 *        parameters in the TIM_OCInitStruct.
 *
 * @param   TIMx - where x (1,2,3,4,5,8) to select the TIM peripheral.
 *          TIM_OCInitStruct - pointer to a TIM_OCInitTypeDef structure.
 *
 * @return  none
 */
void TIM_OC4Init(TIM_TypeDef *TIMx, TIM_OCInitTypeDef *TIM_OCInitStruct) {
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

  TIMx->CCER &= (uint16_t)(~((uint16_t)TIM_CC4E));
  tmpccer = TIMx->CCER;
  tmpcr2 = TIMx->CTLR2;
  tmpccmrx = TIMx->CHCTLR2;
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_OC4M));
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CC4S));
  tmpccmrx |= (uint16_t)(TIM_OCInitStruct->TIM_OCMode << 8);
  tmpccer &= (uint16_t)(~((uint16_t)TIM_CC4P));
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCPolarity << 12);
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputState << 12);

  if ((TIMx == TIM1) || (TIMx == TIM8)) {
    tmpcr2 &= (uint16_t)(~((uint16_t)TIM_OIS4));
    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCIdleState << 6);
  }

  TIMx->CTLR2 = tmpcr2;
  TIMx->CHCTLR2 = tmpccmrx;
  if (TIMx == TIM9 || TIMx == TIM10 || TIMx == TIM11 || TIMx == TIM12) {
    TIMx->CH4CVR_32 = TIM_OCInitStruct->TIM_Pulse;
  } else {
    TIMx->CH4CVR = TIM_OCInitStruct->TIM_Pulse;
  }
  TIMx->CCER = tmpccer;
}

/*********************************************************************
 * @fn      TIM_ICInit
 *
 * @brief   IInitializes the TIM peripheral according to the specified
 *        parameters in the TIM_ICInitStruct.
 * @param   TIMx - where x (1,2,3,4,5,8,9,10,11,12) to select the TIM
 * peripheral. TIM_ICInitStruct - pointer to a TIM_ICInitTypeDef structure.
 *
 * @return  none
 */
__attribute__((optimize("Ofast"))) void
TIM_ICInit(TIM_TypeDef *TIMx, TIM_ICInitTypeDef *TIM_ICInitStruct) {
  if (TIM_ICInitStruct->TIM_Channel == TIM_Channel_1) {
    TI1_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity,
               TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);
    TIM_SetIC1Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  } else if (TIM_ICInitStruct->TIM_Channel == TIM_Channel_2) {
    TI2_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity,
               TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);
    TIM_SetIC2Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  } else if (TIM_ICInitStruct->TIM_Channel == TIM_Channel_3) {
    TI3_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity,
               TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);
    TIM_SetIC3Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  } else {
    TI4_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity,
               TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);
    TIM_SetIC4Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  }
}

/*********************************************************************
 * @fn      TIM_PWMIConfig
 *
 * @brief   Configures the TIM peripheral according to the specified
 *        parameters in the TIM_ICInitStruct to measure an external
 *        PWM signal.
 *
 * @param   TIMx - where x (1,2,3,4,5,8,9,10,11,12) to select the TIM
 * peripheral. TIM_ICInitStruct - pointer to a TIM_ICInitTypeDef structure.
 *
 * @return  none
 */
void TIM_PWMIConfig(TIM_TypeDef *TIMx, TIM_ICInitTypeDef *TIM_ICInitStruct) {
  uint16_t icoppositepolarity = TIM_ICPolarity_Rising;
  uint16_t icoppositeselection = TIM_ICSelection_DirectTI;

  if (TIM_ICInitStruct->TIM_ICPolarity == TIM_ICPolarity_Rising) {
    icoppositepolarity = TIM_ICPolarity_Falling;
  } else {
    icoppositepolarity = TIM_ICPolarity_Rising;
  }

  if (TIM_ICInitStruct->TIM_ICSelection == TIM_ICSelection_DirectTI) {
    icoppositeselection = TIM_ICSelection_IndirectTI;
  } else {
    icoppositeselection = TIM_ICSelection_DirectTI;
  }

  if (TIM_ICInitStruct->TIM_Channel == TIM_Channel_1) {
    TI1_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity,
               TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);
    TIM_SetIC1Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
    TI2_Config(TIMx, icoppositepolarity, icoppositeselection,
               TIM_ICInitStruct->TIM_ICFilter);
    TIM_SetIC2Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  } else {
    TI2_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity,
               TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);
    TIM_SetIC2Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
    TI1_Config(TIMx, icoppositepolarity, icoppositeselection,
               TIM_ICInitStruct->TIM_ICFilter);
    TIM_SetIC1Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  }
}

/*********************************************************************
 * @fn      TIM_BDTRConfig
 *
 * @brief   Configures the: Break feature, dead time, Lock level, the OSSI,
 *        the OSSR State and the AOE(automatic output enable).
 *
 * @param   TIMx - where x can be 1 , 8 to select the TIM peripheral.
 *          TIM_BDTRInitStruct - pointer to a TIM_BDTRInitTypeDef structure.
 *
 * @return  none
 */
void TIM_BDTRConfig(TIM_TypeDef *TIMx,
                    TIM_BDTRInitTypeDef *TIM_BDTRInitStruct) {
  TIMx->BDTR =
      (uint32_t)TIM_BDTRInitStruct->TIM_OSSRState |
      TIM_BDTRInitStruct->TIM_OSSIState | TIM_BDTRInitStruct->TIM_LOCKLevel |
      TIM_BDTRInitStruct->TIM_DeadTime | TIM_BDTRInitStruct->TIM_Break |
      TIM_BDTRInitStruct->TIM_BreakPolarity |
      TIM_BDTRInitStruct->TIM_AutomaticOutput;
}

/*********************************************************************
 * @fn      TIM_TimeBaseStructInit
 *
 * @brief   Fills each TIM_TimeBaseInitStruct member with its default value.
 *        TIMx can be (1,2,3,4,5,8) to select the TIM peripheral.
 *
 * @param   TIM_TimeBaseInitStruct - pointer to a TIM_TimeBaseInitTypeDef
 * structure.
 *
 * @return  none
 */
void TIM_TimeBaseStructInit(TIM_TimeBaseInitTypeDef *TIM_TimeBaseInitStruct) {
  TIM_TimeBaseInitStruct->TIM_Period = 0xFFFF;
  TIM_TimeBaseInitStruct->TIM_Prescaler = 0x0000;
  TIM_TimeBaseInitStruct->TIM_ClockDivision = TIM_CKD_DIV1;
  TIM_TimeBaseInitStruct->TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInitStruct->TIM_RepetitionCounter = 0x0000;
}

/*********************************************************************
 * @fn      TIM_OCStructInit
 *
 * @brief   Fills each TIM_OCInitStruct member with its default value.
 *        TIMx can be (1,2,3,4,5,8)  to select the TIM peripheral.
 *
 * @param   TIM_OCInitStruct - pointer to a TIM_OCInitTypeDef structure.
 *
 * @return  none
 */
void TIM_OCStructInit(TIM_OCInitTypeDef *TIM_OCInitStruct) {
  TIM_OCInitStruct->TIM_OCMode = TIM_OCMode_Timing;
  TIM_OCInitStruct->TIM_OutputState = TIM_OutputState_Disable;
  TIM_OCInitStruct->TIM_OutputNState = TIM_OutputNState_Disable;
  TIM_OCInitStruct->TIM_Pulse = 0x0000;
  TIM_OCInitStruct->TIM_OCPolarity = TIM_OCPolarity_High;
  TIM_OCInitStruct->TIM_OCNPolarity = TIM_OCPolarity_High;
  TIM_OCInitStruct->TIM_OCIdleState = TIM_OCIdleState_Reset;
  TIM_OCInitStruct->TIM_OCNIdleState = TIM_OCNIdleState_Reset;
}

/*********************************************************************
 * @fn      TIM_ICStructInit
 *
 * @brief   Fills each TIM_ICInitStruct member with its default value.
 *
 * @param   TIM_ICInitStruct - pointer to a TIM_ICInitTypeDef structure.
 *          TIM6/TIM7 do not have capture and output functions
 *
 * @return  none
 */
void TIM_ICStructInit(TIM_ICInitTypeDef *TIM_ICInitStruct) {
  TIM_ICInitStruct->TIM_Channel = TIM_Channel_1;
  TIM_ICInitStruct->TIM_ICPolarity = TIM_ICPolarity_Rising;
  TIM_ICInitStruct->TIM_ICSelection = TIM_ICSelection_DirectTI;
  TIM_ICInitStruct->TIM_ICPrescaler = TIM_ICPSC_DIV1;
  TIM_ICInitStruct->TIM_ICFilter = 0x00;
}

/*********************************************************************
 * @fn      TIM_BDTRStructInit
 *
 * @brief   Fills each TIM_BDTRInitStruct member with its default value.
 *
 * @param   TIM_BDTRInitStruct - pointer to a TIM_BDTRInitTypeDef structure.
 *                          Only TIM1,TIM8 have BDTR function.
 *
 * @return  none
 */
void TIM_BDTRStructInit(TIM_BDTRInitTypeDef *TIM_BDTRInitStruct) {
  TIM_BDTRInitStruct->TIM_OSSRState = TIM_OSSRState_Disable;
  TIM_BDTRInitStruct->TIM_OSSIState = TIM_OSSIState_Disable;
  TIM_BDTRInitStruct->TIM_LOCKLevel = TIM_LOCKLevel_OFF;
  TIM_BDTRInitStruct->TIM_DeadTime = 0x00;
  TIM_BDTRInitStruct->TIM_Break = TIM_Break_Disable;
  TIM_BDTRInitStruct->TIM_BreakPolarity = TIM_BreakPolarity_Low;
  TIM_BDTRInitStruct->TIM_AutomaticOutput = TIM_AutomaticOutput_Disable;
}

/*********************************************************************
 * @fn      TIM_Cmd
 *
 * @brief   Enables or disables the specified TIM peripheral.
 *
 * @param   TIMx - where x can be 1 to 12 to select the TIM peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void TIM_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState) {
  if (NewState != DISABLE) {
    TIMx->CTLR1 |= TIM_CEN;
  } else {
    TIMx->CTLR1 &= (uint16_t)(~((uint16_t)TIM_CEN));
  }
}

/*********************************************************************
 * @fn      TIM_CtrlPWMOutputs
 *
 * @brief   Enables or disables the TIM peripheral Main Outputs.
 *
 * @param   TIMx - where x can be 1,8 to select the TIM peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void TIM_CtrlPWMOutputs(TIM_TypeDef *TIMx, FunctionalState NewState) {
  if (NewState != DISABLE) {
    TIMx->BDTR |= TIM_MOE;
  } else {
    TIMx->BDTR &= (uint16_t)(~((uint16_t)TIM_MOE));
  }
}

/*********************************************************************
 * @fn      TIM_ITConfig
 *
 * @brief   Enables or disables the specified TIM interrupts.
 *
 * @param   TIMx - where x can be 1 to 12 to select the TIM peripheral.
 *          TIM_IT - specifies the TIM interrupts sources to be enabled or
 * disabled. TIM_IT_Update - TIM update Interrupt source. TIM_IT_CC1 - TIM
 * Capture Compare 1 Interrupt source��not for TIM6/TIM7. TIM_IT_CC2 - TIM
 * Capture Compare 2 Interrupt source��not for TIM6/TIM7. TIM_IT_CC3 - TIM
 * Capture Compare 3 Interrupt source��not for TIM6/TIM7. TIM_IT_CC4 - TIM
 * Capture Compare 4 Interrupt source��not for TIM6/TIM7. TIM_IT_COM - TIM
 * Commutation Interrupt source, only for TIM1/TIM8. TIM_IT_Trigger - TIM
 * Trigger Interrupt source��not for TIM6/TIM7. TIM_IT_Break - TIM Break
 * Interrupt source, only for TIM1/TIM8. NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void TIM_ITConfig(TIM_TypeDef *TIMx, uint16_t TIM_IT,
                  FunctionalState NewState) {
  if (NewState != DISABLE) {
    TIMx->DMAINTENR |= TIM_IT;
  } else {
    TIMx->DMAINTENR &= (uint16_t)~TIM_IT;
  }
}

/*********************************************************************
 * @fn      TIM_GenerateEvent
 *
 * @brief   Configures the TIMx event to be generate by software.
 *
 * @param   TIMx - where x can be 1 to 12 to generate Event.
 *          TIM_EventSource
 *            TIM_EventSource_Update - Update Event.
 *            TIM_EventSource_CC1 - TIM Capture Compare 1 Event,not for
 * TIM6/TIM7. TIM_EventSource_CC2 - TIM Capture Compare 2 Event,not for
 * TIM6/TIM7. TIM_EventSource_CC3 - TIM Capture Compare 3 Event,not for
 * TIM6/TIM7. TIM_EventSource_CC4 - TIM Capture Compare 4 Event,not for
 * TIM6/TIM7. TIM_EventSource_COM - TIM Commutation Event, only for TIM1/TIM8.
 *            TIM_EventSource_Trigger - TIM Trigger Event,not for TIM6/TIM7.
 *            TIM_EventSource_Break - TIM Break Event, only for TIM1/TIM8.
 *
 * @return  none
 */
void TIM_GenerateEvent(TIM_TypeDef *TIMx, uint16_t TIM_EventSource) {
  TIMx->SWEVGR = TIM_EventSource;
}

/*********************************************************************
 * @fn      TIM_DMAConfig
 *
 * @brief   Configures the TIMx's DMA interface.
 *
 * @param   TIMx - where x (1,2,3,4,5,8,9,10,11,12) to select the TIM
 * peripheral. TIM_DMABase - DMA Base address. TIM_DMABase_CR1. TIM_DMABase_CR2.
 *            TIM_DMABase_SMCR.
 *            TIM_DMABase_DIER.
 *            TIM1_DMABase_SR.
 *            TIM_DMABase_EGR.
 *            TIM_DMABase_CCMR1.
 *            TIM_DMABase_CCMR2.
 *            TIM_DMABase_CCER.
 *            TIM_DMABase_CNT.
 *            TIM_DMABase_PSC.
 *            TIM_DMABase_CCR1.
 *            TIM_DMABase_CCR2.
 *            TIM_DMABase_CCR3.
 *            TIM_DMABase_CCR4.
 *            TIM_DMABase_BDTR.
 *            TIM_DMABase_DCR.
 *          TIM_DMABurstLength - DMA Burst length.
 *            TIM_DMABurstLength_xTransfer - x can select(1~18).
 *
 * @return  none
 */
void TIM_DMAConfig(TIM_TypeDef *TIMx, uint16_t TIM_DMABase,
                   uint16_t TIM_DMABurstLength) {
  TIMx->DMACFGR = TIM_DMABase | TIM_DMABurstLength;
}

/*********************************************************************
 * @fn      TIM_DMACmd
 *
 * @brief   Enables or disables the TIMx's DMA Requests.
 *
 * @param   TIMx - where x can be 1 to 12 to select the TIM peripheral.
 *          TIM_DMASource - specifies the DMA Request sources.
 *            TIM_DMA_Update - TIM update Interrupt source.
 *            TIM_DMA_CC1 - TIM Capture Compare 1 DMA source��not for TIM6/TIM7.
 *            TIM_DMA_CC2 - TIM Capture Compare 2 DMA source��not for TIM6/TIM7.
 *            TIM_DMA_CC3 - TIM Capture Compare 3 DMA source��not for TIM6/TIM7.
 *            TIM_DMA_CC4 - TIM Capture Compare 4 DMA source��not for TIM6/TIM7.
 *            TIM_DMA_COM - TIM Commutation DMA source, only for TIM1/TIM8.
 *            TIM_DMA_Trigger - TIM Trigger DMA source.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void TIM_DMACmd(TIM_TypeDef *TIMx, uint16_t TIM_DMASource,
                FunctionalState NewState) {
  if (NewState != DISABLE) {
    TIMx->DMAINTENR |= TIM_DMASource;
  } else {
    TIMx->DMAINTENR &= (uint16_t)~TIM_DMASource;
  }
}

/*********************************************************************
 * @fn      TIM_InternalClockConfig
 *
 * @brief   Configures the TIMx internal Clock.
 *
 * @param   TIMx - where x (1,2,3,4,5,8,9,10,11,12)to select the TIM peripheral.
 *
 * @return  none
 */
void TIM_InternalClockConfig(TIM_TypeDef *TIMx) {
  TIMx->SMCFGR &= (uint16_t)(~((uint16_t)TIM_SMS));
}

/*********************************************************************
 * @fn      TIM_ITRxExternalClockConfig
 *
 * @brief   Configures the TIMx Internal Trigger as External Clock.
 *
 * @param   TIMx - where x (1,2,3,4,5,8,9,10,11,12) to select the TIM
 * peripheral. TIM_InputTriggerSource: Trigger source. TIM_TS_ITR0 - Internal
 * Trigger 0. TIM_TS_ITR1 - Internal Trigger 1. TIM_TS_ITR2 - Internal
 * Trigger 2. TIM_TS_ITR3 - Internal Trigger 3.
 *
 * @return  none
 */
void TIM_ITRxExternalClockConfig(TIM_TypeDef *TIMx,
                                 uint16_t TIM_InputTriggerSource) {
  TIM_SelectInputTrigger(TIMx, TIM_InputTriggerSource);
  TIMx->SMCFGR |= TIM_SlaveMode_External1;
}

/*********************************************************************
 * @fn      TIM_TIxExternalClockConfig
 *
 * @brief   Configures the TIMx Trigger as External Clock.
 *
 * @param   TIMx - where x(1,2,3,4,5,8,9,10,11,12) to select the TIM peripheral.
 *          TIM_TIxExternalCLKSource - Trigger source.
 *            TIM_TIxExternalCLK1Source_TI1ED - TI1 Edge Detector.
 *            TIM_TIxExternalCLK1Source_TI1 - Filtered Timer Input 1.
 *            TIM_TIxExternalCLK1Source_TI2 - Filtered Timer Input 2.
 *          TIM_ICPolarity - specifies the TIx Polarity.
 *             TIM_ICPolarity_Rising.
 *             TIM_ICPolarity_Falling.
 *             TIM_DMA_COM - TIM Commutation DMA source.
 *             TIM_DMA_Trigger - TIM Trigger DMA source.
 *          ICFilter - specifies the filter value.
 *             This parameter must be a value between 0x0 and 0xF.
 *
 * @return  none
 */
void TIM_TIxExternalClockConfig(TIM_TypeDef *TIMx,
                                uint16_t TIM_TIxExternalCLKSource,
                                uint16_t TIM_ICPolarity, uint16_t ICFilter) {
  if (TIM_TIxExternalCLKSource == TIM_TIxExternalCLK1Source_TI2) {
    TI2_Config(TIMx, TIM_ICPolarity, TIM_ICSelection_DirectTI, ICFilter);
  } else {
    TI1_Config(TIMx, TIM_ICPolarity, TIM_ICSelection_DirectTI, ICFilter);
  }

  TIM_SelectInputTrigger(TIMx, TIM_TIxExternalCLKSource);
  TIMx->SMCFGR |= TIM_SlaveMode_External1;
}

/*********************************************************************
 * @fn      TIM_ETRClockMode1Config
 *
 * @brief   Configures the External clock Mode1.
 *
 * @param   TIMx - where x (1,2,3,4,5,8,9,10,11,12) to select the TIM
 * peripheral. TIM_ExtTRGPrescaler - The external Trigger Prescaler.
 *            TIM_ExtTRGPSC_OFF - ETRP Prescaler OFF.
 *            TIM_ExtTRGPSC_DIV2 - ETRP frequency divided by 2.
 *            TIM_ExtTRGPSC_DIV4 - ETRP frequency divided by 4.
 *            TIM_ExtTRGPSC_DIV8 - ETRP frequency divided by 8.
 *          TIM_ExtTRGPolarity - The external Trigger Polarity.
 *            TIM_ExtTRGPolarity_Inverted - active low or falling edge active.
 *            TIM_ExtTRGPolarity_NonInverted - active high or rising edge
 * active. ExtTRGFilter - External Trigger Filter. This parameter must be a
 * value between 0x0 and 0xF.
 *
 * @return  none
 */
void TIM_ETRClockMode1Config(TIM_TypeDef *TIMx, uint16_t TIM_ExtTRGPrescaler,
                             uint16_t TIM_ExtTRGPolarity,
                             uint16_t ExtTRGFilter) {
  uint16_t tmpsmcr = 0;

  TIM_ETRConfig(TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter);
  tmpsmcr = TIMx->SMCFGR;
  tmpsmcr &= (uint16_t)(~((uint16_t)TIM_SMS));
  tmpsmcr |= TIM_SlaveMode_External1;
  tmpsmcr &= (uint16_t)(~((uint16_t)TIM_TS));
  tmpsmcr |= TIM_TS_ETRF;
  TIMx->SMCFGR = tmpsmcr;
}

/*********************************************************************
 * @fn      TIM_ETRClockMode2Config
 *
 * @brief   Configures the External clock Mode2.
 *
 * @param   TIMx - where x (1,2,3,4,5,8,9,10,11,12) to select the TIM
 * peripheral. TIM_ExtTRGPrescaler - The external Trigger Prescaler.
 *            TIM_ExtTRGPSC_OFF - ETRP Prescaler OFF.
 *            TIM_ExtTRGPSC_DIV2 - ETRP frequency divided by 2.
 *            TIM_ExtTRGPSC_DIV4 - ETRP frequency divided by 4.
 *            TIM_ExtTRGPSC_DIV8 - ETRP frequency divided by 8.
 *          TIM_ExtTRGPolarity - The external Trigger Polarity.
 *            TIM_ExtTRGPolarity_Inverted - active low or falling edge active.
 *            TIM_ExtTRGPolarity_NonInverted - active high or rising edge
 * active. ExtTRGFilter - External Trigger Filter. This parameter must be a
 * value between 0x0 and 0xF.
 *
 * @return  none
 */
void TIM_ETRClockMode2Config(TIM_TypeDef *TIMx, uint16_t TIM_ExtTRGPrescaler,
                             uint16_t TIM_ExtTRGPolarity,
                             uint16_t ExtTRGFilter) {
  TIM_ETRConfig(TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter);
  TIMx->SMCFGR |= TIM_ECE;
}

