betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_tim.c
/*********************************************************************
 * @fn      TIM_GetCapture1
 *
 * @brief   Gets the TIMx Input Capture 1 value.
 *
 * @param   TIMx - where x (1,2,3,4,5,8) select the TIM peripheral.
 *
 * @return  TIMx->CH1CVR - Capture Compare 1 Register value.
 */
uint16_t TIM_GetCapture1(TIM_TypeDef *TIMx) { return TIMx->CH1CVR; }

/*********************************************************************
 * @fn      TIM_GetCapture2
 *
 * @brief   Gets the TIMx Input Capture 2 value.
 *
 * @param   TIMx - where x (1,2,3,4,5,8) select the TIM peripheral.
 *
 * @return  TIMx->CH2CVR - Capture Compare 2 Register value.
 */
uint16_t TIM_GetCapture2(TIM_TypeDef *TIMx) { return TIMx->CH2CVR; }

/*********************************************************************
 * @fn      TIM_GetCapture3
 *
 * @brief   Gets the TIMx Input Capture 3 value.
 *
 * @param   TIMx - where x (1,2,3,4,5,8) select the TIM peripheral.
 *
 * @return  TIMx->CH3CVR - Capture Compare 3 Register value.
 */
uint16_t TIM_GetCapture3(TIM_TypeDef *TIMx) { return TIMx->CH3CVR; }

/*********************************************************************
 * @fn      TIM_GetCapture4
 *
 * @brief   Gets the TIMx Input Capture 4 value.
 *
 * @param   TIMx - where x (1,2,3,4,5,8) select the TIM peripheral.
 *
 * @return  TIMx->CH4CVR - Capture Compare 4 Register value.
 */
uint16_t TIM_GetCapture4(TIM_TypeDef *TIMx) { return TIMx->CH4CVR; }

/*********************************************************************
 * @fn      TIM_GetCounter
 *
 * @brief   Gets the TIMx Counter value.
 *
 * @param   TIMx - where x can be 1 to 8 select the TIM peripheral.
 *
 * @return  TIMx->CNT - Counter Register value.
 */
uint16_t TIM_GetCounter(TIM_TypeDef *TIMx) { return TIMx->CNT; }

/*********************************************************************
 * @fn      TIM_GetPrescaler
 *
 * @brief   Gets the TIMx Prescaler value.
 *
 * @param   TIMx - where x can be 1 to 12 select the TIM peripheral.
 *
 * @return  TIMx->PSC - Prescaler Register value.
 */
uint16_t TIM_GetPrescaler(TIM_TypeDef *TIMx) { return TIMx->PSC; }

/*********************************************************************
 * @fn      TIM_GetFlagStatus
 *
 * @brief   Checks whether the specified TIM flag is set or not.
 *
 * @param   TIMx - where x can be 1 to 4 select the TIM peripheral.
 *          TIM_FLAG - specifies the flag to check.
 *            TIM_FLAG_Update - TIM update Flag.
 *            TIM_FLAG_CC1 - TIM Capture Compare 1 Flag��not for TIM6/TIM7.
 *            TIM_FLAG_CC2 - TIM Capture Compare 2 Flag��not for TIM6/TIM7.
 *            TIM_FLAG_CC3 - TIM Capture Compare 3 Flag��not for TIM6/TIM7.
 *            TIM_FLAG_CC4 - TIM Capture Compare 4 Flag��not for TIM6/TIM7.
 *            TIM_FLAG_COM - TIM Commutation Flag, only for TIM1/TIM8.
 *            TIM_FLAG_Trigger - TIM Trigger Flag��not for TIM6/TIM7.
 *            TIM_FLAG_Break - TIM Break Flag, only for TIM1/TIM8.
 *            TIM_FLAG_CC1OF - TIM Capture Compare 1 overcapture Flag��not for
 * TIM6/TIM7. TIM_FLAG_CC2OF - TIM Capture Compare 2 overcapture Flag��not for
 * TIM6/TIM7. TIM_FLAG_CC3OF - TIM Capture Compare 3 overcapture Flag��not for
 * TIM6/TIM7. TIM_FLAG_CC4OF - TIM Capture Compare 4 overcapture Flag��not for
 * TIM6/TIM7.
 *
 * @return  none
 */
FlagStatus TIM_GetFlagStatus(TIM_TypeDef *TIMx, uint16_t TIM_FLAG) {
  ITStatus bitstatus = RESET;

  if ((TIMx->INTFR & TIM_FLAG) != (uint16_t)RESET) {
    bitstatus = SET;
  } else {
    bitstatus = RESET;
  }

  return bitstatus;
}

/*********************************************************************
 * @fn      TIM_ClearFlag
 *
 * @brief   Clears the TIMx's pending flags.
 *
 * @param   TIMx - where x can be 1 to 12 select the TIM peripheral.
 *          TIM_FLAG - specifies the flag to check.
 *            TIM_FLAG_Update - TIM update Flag.
 *            TIM_FLAG_CC1 - TIM Capture Compare 1 Flag��not for TIM6/TIM7.
 *            TIM_FLAG_CC2 - TIM Capture Compare 2 Flag��not for TIM6/TIM7.
 *            TIM_FLAG_CC3 - TIM Capture Compare 3 Flag��not for TIM6/TIM7.
 *            TIM_FLAG_CC4 - TIM Capture Compare 4 Flag��not for TIM6/TIM7.
 *            TIM_FLAG_COM - TIM Commutation Flag, only for TIM1/TIM8.
 *            TIM_FLAG_Trigger - TIM Trigger Flag��not for TIM6/TIM7.
 *            TIM_FLAG_Break - TIM Break Flag, only for TIM1/TIM8.
 *            TIM_FLAG_CC1OF - TIM Capture Compare 1 overcapture Flag��not for
 * TIM6/TIM7. TIM_FLAG_CC2OF - TIM Capture Compare 2 overcapture Flag��not for
 * TIM6/TIM7. TIM_FLAG_CC3OF - TIM Capture Compare 3 overcapture Flag��not for
 * TIM6/TIM7. TIM_FLAG_CC4OF - TIM Capture Compare 4 overcapture Flag��not for
 * TIM6/TIM7.
 *
 * @return  none
 */
void TIM_ClearFlag(TIM_TypeDef *TIMx, uint16_t TIM_FLAG) {
  TIMx->INTFR = (uint16_t)~TIM_FLAG;
}

/*********************************************************************
 * @fn      TIM_GetITStatus
 *
 * @brief   Checks whether the TIM interrupt has occurred or not.
 *
 * @param   TIMx - where x can be 1 to 12 select the TIM peripheral.
 *          TIM_IT - specifies the TIM interrupt source to check.
 *            TIM_IT_Update - TIM update Interrupt source.
 *            TIM_IT_CC1 - TIM Capture Compare 1 Interrupt source��not for
 * TIM6/TIM7. TIM_IT_CC2 - TIM Capture Compare 2 Interrupt source��not for
 * TIM6/TIM7. TIM_IT_CC3 - TIM Capture Compare 3 Interrupt source��not for
 * TIM6/TIM7. TIM_IT_CC4 - TIM Capture Compare 4 Interrupt source��not for
 * TIM6/TIM7. TIM_IT_COM - TIM Commutation Interrupt source, only for TIM1/TIM8.
 *            TIM_IT_Trigger - TIM Trigger Interrupt source��not for TIM6/TIM7.
 *            TIM_IT_Break - TIM Break Interrupt source, only for TIM1/TIM8.
 *
 * @return  none
 */
ITStatus TIM_GetITStatus(TIM_TypeDef *TIMx, uint16_t TIM_IT) {
  ITStatus bitstatus = RESET;
  uint16_t itstatus = 0x0, itenable = 0x0;

  itstatus = TIMx->INTFR & TIM_IT;

  itenable = TIMx->DMAINTENR & TIM_IT;
  if ((itstatus != (uint16_t)RESET) && (itenable != (uint16_t)RESET)) {
    bitstatus = SET;
  } else {
    bitstatus = RESET;
  }

