betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_tim.c
  TIMx->CCER &= (uint16_t)~((uint16_t)TIM_CC4E);
  tmpccmr2 = TIMx->CHCTLR2;
  tmpccer = TIMx->CCER;
  tmp = (uint16_t)(TIM_ICPolarity << 12);
  tmpccmr2 &= (uint16_t)((uint16_t)(~(uint16_t)TIM_CC4S) &
                         ((uint16_t)~((uint16_t)TIM_IC4F)));
  tmpccmr2 |= (uint16_t)(TIM_ICSelection << 8);
  tmpccmr2 |= (uint16_t)(TIM_ICFilter << 12);

  tmpccer &= (uint16_t)~((uint16_t)(TIM_CC4P));
  tmpccer |= (uint16_t)(tmp | (uint16_t)TIM_CC4E);

  TIMx->CHCTLR2 = tmpccmr2;
  TIMx->CCER = tmpccer;
}

/*********************************************************************
 * @fn      TIM9_12_TimeBaseInit
 *
 * @brief   Initializes the TIMx Time Base Unit peripheral according to
 *        the specified parameters in the TIM9_12_TimeBaseInitTypeDef.
 *           TIMx can be (9 to 12) to select the TIM peripheral.
 *
 * @param   TIMx - where x can be (9 to 12) to select the TIM peripheral.
 *          TIM_TimeBaseInitStruct - pointer to a TIM9_12_TimeBaseInitTypeDef
 *        structure.
 *
 * @return  none
 */
void TIM9_12_TimeBaseInit(TIM_TypeDef *TIMx,
                          TIM9_12_TimeBaseInitTypeDef *TIM_TimeBaseInitStruct) {
  uint16_t tmpcr1 = 0;

  tmpcr1 = TIMx->CTLR1;
  tmpcr1 &= (uint16_t)(~((uint16_t)(TIM_DIR | TIM_CMS)));
  tmpcr1 |= (uint32_t)TIM_TimeBaseInitStruct->TIM_CounterMode;
  tmpcr1 &= (uint16_t)(~((uint16_t)TIM_CTLR1_CKD));
  tmpcr1 |= (uint32_t)TIM_TimeBaseInitStruct->TIM_ClockDivision;
  TIMx->CTLR1 = tmpcr1;

  TIMx->ATRLR_32 = TIM_TimeBaseInitStruct->TIM_Period;
  TIMx->PSC = TIM_TimeBaseInitStruct->TIM_Prescaler;
  TIMx->SWEVGR = TIM_PSCReloadMode_Immediate;
}

/*********************************************************************
 * @fn      TIM9_12_TimeBaseStructInit
 *
 * @brief   Fills each TIM9_12_TimeBaseInitTypeDef member with its default
 * value. TIMx can be (9 to 12) to select the TIM peripheral.
 *
 * @param   TIM_TimeBaseInitStruct - pointer to a TIM9_12_TimeBaseInitTypeDef
 * structure.
 *
 * @return  none
 */
void TIM9_12_TimeBaseStructInit(
    TIM9_12_TimeBaseInitTypeDef *TIM_TimeBaseInitStruct) {
  TIM_TimeBaseInitStruct->TIM_Period = 0xFFFFFFFF;
  TIM_TimeBaseInitStruct->TIM_Prescaler = 0x0000;
  TIM_TimeBaseInitStruct->TIM_ClockDivision = TIM_CKD_DIV1;
  TIM_TimeBaseInitStruct->TIM_CounterMode = TIM_CounterMode_Up;
}

/*********************************************************************
 * @fn      TIM9_12_OC1Init
 *
 * @brief   Initializes the TIMx Channel1 according to the specified
 *        parameters in the TIM_OCInitStruct.
 *
 * @param   TIMx - where x (9 to 12) to select the TIM peripheral.
 *          TIM_OCInitStruct - pointer to a TIM_OCInitTypeDef structure.
 *
 * @return  none
 */
void TIM9_12_OC1Init(TIM_TypeDef *TIMx,
                     TIM9_12_OCInitTypeDef *TIM_OCInitStruct) {
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

  TIMx->CCER &= (uint16_t)(~(uint16_t)TIM_CC1E);
  tmpccer = TIMx->CCER;
  tmpcr2 = TIMx->CTLR2;
  tmpccmrx = TIMx->CHCTLR1;
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_OC1M));
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CC1S));
  tmpccmrx |= TIM_OCInitStruct->TIM_OCMode;
  tmpccer &= (uint16_t)(~((uint16_t)TIM_CC1P));
  tmpccer |= TIM_OCInitStruct->TIM_OCPolarity;
  tmpccer |= TIM_OCInitStruct->TIM_OutputState;

  TIMx->CTLR2 = tmpcr2;
  TIMx->CHCTLR1 = tmpccmrx;
  TIMx->CH1CVR_32 = TIM_OCInitStruct->TIM_Pulse;
  TIMx->CCER = tmpccer;
}

/*********************************************************************
 * @fn      TIM9_12_OC2Init
 *
 * @brief   Initializes the TIMx Channel2 according to the specified
 *        parameters in the TIM9_12_OCInitStruct.
 *
 * @param   TIMx - where x (9 to 12) to select the TIM peripheral.
 *          TIM_OCInitStruct - pointer to a TIM9_12_OCInitTypeDef structure.
 *
 * @return  none
 */
void TIM9_12_OC2Init(TIM_TypeDef *TIMx,
                     TIM9_12_OCInitTypeDef *TIM_OCInitStruct) {
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

  TIMx->CCER &= (uint16_t)(~((uint16_t)TIM_CC2E));
  tmpccer = TIMx->CCER;
  tmpcr2 = TIMx->CTLR2;
  tmpccmrx = TIMx->CHCTLR1;
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_OC2M));
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CC2S));
  tmpccmrx |= (uint16_t)(TIM_OCInitStruct->TIM_OCMode << 8);
  tmpccer &= (uint16_t)(~((uint16_t)TIM_CC2P));
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCPolarity << 4);
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputState << 4);

  TIMx->CTLR2 = tmpcr2;
  TIMx->CHCTLR1 = tmpccmrx;
  TIMx->CH2CVR_32 = TIM_OCInitStruct->TIM_Pulse;
  TIMx->CCER = tmpccer;
}

/*********************************************************************
 * @fn      TIM9_12_OC3Init
 *
 * @brief   Initializes the TIMx Channel3 according to the specified
 *        parameters in the TIM9_12_OCInitStruct.
 *
 * @param   TIMx - where x (9 to 12) to select the TIM peripheral.
 *          TIM_OCInitStruct - pointer to a TIM9_12_OCInitTypeDef structure.
 *
 * @return  none
 */
void TIM9_12_OC3Init(TIM_TypeDef *TIMx,
                     TIM9_12_OCInitTypeDef *TIM_OCInitStruct) {
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

  TIMx->CCER &= (uint16_t)(~((uint16_t)TIM_CC3E));
  tmpccer = TIMx->CCER;
  tmpcr2 = TIMx->CTLR2;
  tmpccmrx = TIMx->CHCTLR2;
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_OC3M));
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CC3S));
  tmpccmrx |= TIM_OCInitStruct->TIM_OCMode;
  tmpccer &= (uint16_t)(~((uint16_t)TIM_CC3P));
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCPolarity << 8);
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputState << 8);

  TIMx->CTLR2 = tmpcr2;
  TIMx->CHCTLR2 = tmpccmrx;
  TIMx->CH3CVR_32 = TIM_OCInitStruct->TIM_Pulse;
  TIMx->CCER = tmpccer;
}

/*********************************************************************
 * @fn      TIM9_12_OC4Init
 *
 * @brief   Initializes the TIMx Channel4 according to the specified
 *        parameters in the TIM9_12_OCInitStruct.
 *
 * @param   TIMx - where x (9 to 12) to select the TIM peripheral.
 *          TIM_OCInitStruct - pointer to a TIM9_12_OCInitTypeDef structure.
 *
 * @return  none
 */
void TIM9_12_OC4Init(TIM_TypeDef *TIMx,
                     TIM9_12_OCInitTypeDef *TIM_OCInitStruct) {
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

