betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_tim.c
  TIMx->CCER &= (uint16_t)(~((uint16_t)TIM_CC4E));
  tmpccer = TIMx->CCER;
  tmpcr2 = TIMx->CTLR2;
  tmpccmrx = TIMx->CHCTLR2;
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_OC4M));
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CC4S));
  tmpccmrx |= (uint16_t)(TIM_OCInitStruct->TIM_OCMode << 8);
  tmpccer &= (uint16_t)(~((uint16_t)TIM_CC4P));
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCPolarity << 12);
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputState << 12);

  TIMx->CTLR2 = tmpcr2;
  TIMx->CHCTLR2 = tmpccmrx;
  TIMx->CH4CVR_32 = TIM_OCInitStruct->TIM_Pulse;
  TIMx->CCER = tmpccer;
}

/*********************************************************************
 * @fn      TIM9_12_OCStructInit
 *
 * @brief   Fills each TIM9_12_OCInitStruct member with its default value.
 *        TIMx can be (9 to 12) to select the TIM peripheral.
 *
 * @param   TIM_OCInitStruct - pointer to a TIM9_12_OCInitTypeDef structure.
 *
 * @return  none
 */
void TIM9_12_OCStructInit(TIM9_12_OCInitTypeDef *TIM_OCInitStruct) {
  TIM_OCInitStruct->TIM_OCMode = TIM_OCMode_Timing;
  TIM_OCInitStruct->TIM_OutputState = TIM_OutputState_Disable;
  TIM_OCInitStruct->TIM_Pulse = 0x00000000;
  TIM_OCInitStruct->TIM_OCPolarity = TIM_OCPolarity_High;
}

/*********************************************************************
 * @fn      TIM9_12_SetCounter
 *
 * @brief   Sets the TIMx Counter Register value.
 *
 * @param   TIMx - where x can be (9 to 12) select the TIM peripheral.
 *          Counter - specifies the Counter register new value.
 *
 * @return  none
 */
void TIM9_12_SetCounter(TIM_TypeDef *TIMx, uint32_t Counter) {
  TIMx->CNT_32 = Counter;
}

/*********************************************************************
 * @fn      TIM9_12_SetAutoreload
 *
 * @brief   Sets the TIMx Autoreload Register value.
 *
 * @param   TIMx - where x can be (9 to 12) select the TIM peripheral.
 *          Autoreload - specifies the Autoreload register new value.
 *
 * @return  none
 */
void TIM9_12_SetAutoreload(TIM_TypeDef *TIMx, uint32_t Autoreload) {
  TIMx->ATRLR_32 = Autoreload;
}

/*********************************************************************
 * @fn      TIM9_12_SetCompare1
 *
 * @brief   Sets the TIMx Capture Compare1 Register value.
 *
 * @param   TIMx - where x (9 to 12) select the TIM peripheral.
 *          Compare1 - specifies the Capture Compare1 register new value.
 *
 * @return  none
 */
void TIM9_12_SetCompare1(TIM_TypeDef *TIMx, uint32_t Compare1) {
  TIMx->CH1CVR_32 = Compare1;
}

/*********************************************************************
 * @fn      TIM9_12_SetCompare2
 *
 * @brief   Sets the TIMx Capture Compare2 Register value.
 *
 * @param   TIMx - where x (9 to 12) select the TIM peripheral.
 *          Compare1 - specifies the Capture Compare1 register new value.
 *
 * @return  none
 */
void TIM9_12_SetCompare2(TIM_TypeDef *TIMx, uint32_t Compare2) {
  TIMx->CH2CVR_32 = Compare2;
}

/*********************************************************************
 * @fn      TIM9_12_SetCompare3
 *
 * @brief   Sets the TIMx Capture Compare3 Register value.
 *
 * @param   TIMx - where x (9 to 12) select the TIM peripheral.
 *          Compare1 - specifies the Capture Compare1 register new value.
 *
 * @return  none
 */
void TIM9_12_SetCompare3(TIM_TypeDef *TIMx, uint32_t Compare3) {
  TIMx->CH3CVR_32 = Compare3;
}

/*********************************************************************
 * @fn      TIM9_12_SetCompare4
 *
 * @brief   Sets the TIMx Capture Compare4 Register value.
 *
 * @param   TIMx - where x (9 to 12) select the TIM peripheral.
 *          Compare1 - specifies the Capture Compare1 register new value.
 *
 * @return  none
 */
void TIM9_12_SetCompare4(TIM_TypeDef *TIMx, uint32_t Compare4) {
  TIMx->CH4CVR_32 = Compare4;
}

/*********************************************************************
 * @fn      TIM9_12_GetCapture1
 *
 * @brief   Gets the TIMx Input Capture 1 value.
 *
 * @param   TIMx - where x (9 to 12) select the TIM peripheral.
 *
 * @return  TIMx->CH1CVR - Capture Compare 1 Register value.
 */
uint32_t TIM9_12_GetCapture1(TIM_TypeDef *TIMx) { return TIMx->CH1CVR_32; }

/*********************************************************************
 * @fn      TIM9_12_GetCapture2
 *
 * @brief   Gets the TIMx Input Capture 2 value.
 *
 * @param   TIMx - where x (9 to 12) select the TIM peripheral.
 *
 * @return  TIMx->CH2CVR - Capture Compare 2 Register value.
 */
uint32_t TIM9_12_GetCapture2(TIM_TypeDef *TIMx) { return TIMx->CH2CVR_32; }

/*********************************************************************
 * @fn      TIM9_12_GetCapture3
 *
 * @brief   Gets the TIMx Input Capture 3 value.
 *
 * @param   TIMx - where x (9 to 12) select the TIM peripheral.
 *
 * @return  TIMx->CH3CVR - Capture Compare 3 Register value.
 */
uint32_t TIM9_12_GetCapture3(TIM_TypeDef *TIMx) { return TIMx->CH3CVR_32; }

/*********************************************************************
 * @fn      TIM9_12_GetCapture4
 *
 * @brief   Gets the TIMx Input Capture 4 value.
 *
 * @param   TIMx - where x (9 to 12) select the TIM peripheral.
 *
 * @return  TIMx->CH4CVR - Capture Compare 4 Register value.
 */
uint32_t TIM9_12_GetCapture4(TIM_TypeDef *TIMx) { return TIMx->CH4CVR_32; }

/*********************************************************************
 * @fn      TIM9_12_GetCounter
 *
 * @brief   Gets the TIMx Counter value.
 *
 * @param   TIMx - where x can be (9 to 12) select the TIM peripheral.
 *
 * @return  TIMx->CNT - Counter Register value.
 */
uint32_t TIM9_12_GetCounter(TIM_TypeDef *TIMx) { return TIMx->CNT_32; }

/*********************************************************************
 * @fn      TIM_IC2BothEdge_Cmd
 *
 * @brief   Enables or disables the Both edge capture of the TIMx Channel2.
 *
 * @param   TIMx - where x can be (1,2,3,4,5,8)  to select the TIM peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
__attribute__((optimize("Ofast"))) void
TIM_IC2BothEdge_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState) {
  if (NewState != DISABLE) {
    TIMx->AUX |= TIM_AUX_CAPCH2_ED;
  } else {
    TIMx->AUX &= ~TIM_AUX_CAPCH2_ED;
  }
}

/*********************************************************************
 * @fn      TIM_IC3BothEdge_Cmd
 *
 * @brief   Enables or disables the Both edge capture of the TIMx Channel3.
 *
 * @param   TIMx - where x can be (1,2,3,4,5,8)  to select the TIM peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
__attribute__((optimize("Ofast"))) void
TIM_IC3BothEdge_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState) {
  if (NewState != DISABLE) {
    TIMx->AUX |= TIM_AUX_CAPCH3_ED;
  } else {
    TIMx->AUX &= ~TIM_AUX_CAPCH3_ED;
  }
}

/*********************************************************************
 * @fn      TIM_IC4BothEdge_Cmd
 *
 * @brief   Enables or disables the Both edge capture of the TIMx Channel4.
 *
 * @param   TIMx - where x (1,2,3,4,5,8) to select the TIM peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
__attribute__((optimize("Ofast"))) void
TIM_IC4BothEdge_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState) {
  if (NewState != DISABLE) {
    TIMx->AUX |= TIM_AUX_CAPCH4_ED;
  } else {
    TIMx->AUX &= ~TIM_AUX_CAPCH4_ED;
  }
}

/*********************************************************************
 * @fn      TIM_BrakeSourceConfig
 *
 * @brief   Select Timer brake source .
 *
 * @param   TIMx - where x (1,8) to select the TIM peripheral.
 *            TIM_BKIN1 - Select Brake1 pin as brake source
 *            TIM_BKIN2 - Select Brake2 pin as brake source
 *            TIM_BKIN1_2 - Select Brake1 and Brake2 pin as brake source
 *            TIM_DFSDM_BK0 - Select DFSDM_BK[0] as brake source
 *            TIM_DFSDM_BK1 - Select DFSDM_BK[1] as brake source
 *
 * @return  none
 */
void TIM_BrakeSourceConfig(TIM_TypeDef *TIMx, uint8_t TIM_BK) {
  TIMx->AUX &= ~TIM_AUX_BK_SEL;
  TIMx->AUX |= (uint16_t)(TIM_BK << 3);
}

/*********************************************************************
 * @fn      TIM_DeadTimeAsymmetricConfig
 *
 * @brief   Configures the TIMx complementary output asymmetric dead time.
 *
 * @param   TIMx - where x (1,8) to select the TIM peripheral.
 *          AsymmetricDeadTime - This parameter can be a number between 0x00
 *        to BDTR DTG[7:0].
 *          DT_MODE - Dead time mode.
 *            TIM_DT_MODE_Disable - Disable Dead time mode.
 *            TIM_DT_MODE_Rising - Dead time mode occur to the rising of OCXREF.
 *            TIM_DT_MODE_Falling - Dead time mode occur to the falling of
 * OCXREF. TIM_DT_MODE_BothEdge - Dead time mode occur to the falling and rising
 * of OCXREF.
 *
 * @return  none
 */
void TIM_AsymmetricDeadTimeConfig(TIM_TypeDef *TIMx, uint8_t AsymmetricDeadTime,
                                  uint16_t DT_MODE) {
  TIMx->AUX &= ~(TIM_AUX_DT_VLU2 | TIM_AUX_DT_MODE | TIM_AUX_DTN_MODE);
  TIMx->AUX |= (uint16_t)((uint16_t)AsymmetricDeadTime << 8 | DT_MODE);
}

/*********************************************************************
 * @fn      TIM_ICBothEdgeLevelIndication_Cmd
 *
 * @brief   Enables or disables the Both edge capture level indication of the
 * TIMx.
 *
 * @param   TIMx - where x (1,8) to select the TIM peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void TIM_ICBothEdgeLevelIndication_Cmd(TIM_TypeDef *TIMx,
                                       FunctionalState NewState) {
  if (NewState != DISABLE) {
    TIMx->CTLR1 |= TIM_CAPLVL;
  } else {
    TIMx->CTLR1 &= ~TIM_CAPLVL;
  }
}

/*********************************************************************
 * @fn      TIM_IC_OverflowMode_Config
 *
 * @brief   Select input capture CHxCVR value mode for timer overflow.
 *
 * @param   TIMx - where x (1,8) to select the TIM peripheral.
 *            TIM_IC_OV_Mode0 - CHxCVR is 0xFFFF in timer overflow.
 *            TIM_IC_OV_Mode1 - CHxCVR is input capture value in timer overflow.
 *
 * @return  none
 */
void TIM_IC_OverflowMode_Config(TIM_TypeDef *TIMx, uint16_t IC_OV_Mode) {
  TIMx->CTLR1 &= ~TIM_CAPOV;
  TIMx->CTLR1 |= IC_OV_Mode;
}
